
<details><summary>Show Plan</summary>
```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloud_scheduler_job.limber_jobtestdag_117F8DE7 will be created
  + resource "google_cloud_scheduler_job" "limber_jobtestdag_117F8DE7" {
      + description = "DAG that will for now just create a Google cloud scheduler"
      + id          = (known after apply)
      + name        = "test_dag"
      + project     = (known after apply)
      + region      = (known after apply)
      + schedule    = "0 * * * *"
      + time_zone   = "Etc/UTC"

      + pubsub_target {
          + data       = "dGVzdA=="
          + topic_name = (known after apply)
        }
    }

  # google_pubsub_topic.limber_dagtestdag_B0E364DA will be created
  + resource "google_pubsub_topic" "limber_dagtestdag_B0E364DA" {
      + id      = (known after apply)
      + name    = "dag_test_dag"
      + project = (known after apply)

      + message_storage_policy {
          + allowed_persistence_regions = (known after apply)
        }

      + schema_settings {
          + encoding = (known after apply)
          + schema   = (known after apply)
        }
    }

  # google_storage_bucket.limber_cloudstoragebucket_AB7CB639 will be created
  + resource "google_storage_bucket" "limber_cloudstoragebucket_AB7CB639" {
      + bucket_policy_only          = (known after apply)
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "EU"
      + name                        = "stijnzanders-serverless-etl-bucket"
      + project                     = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @StijnZanders, Action: `pull_request`*